import 'dart:math';

// 正在进行的考试
List<Map> onGonings() {
  const commonString = "正在进行的考试";

  List<Map> result = [];

  for (var i = 0; i < 5; i++) {
    result.add({
      "title": "第${i + 1}个$commonString",
      "description": "第${i + 1}个$commonString的一些备注文字"
    });
  }
  return result;
}

// 等待开始的考试
List<Map> waitings() {
  const commonString = "等待进行的考试";

  List<Map> result = [];

  for (var i = 0; i < 5; i++) {
    result.add({
      "title": "第${i + 1}个$commonString",
      "description": "第${i + 1}个$commonString的一些备注文字"
    });
  }
  return result;
}

// 已经结束的考试
List<Map> ends() {
  const commonString = "已经结束的考试";

  List<Map> result = [];

  for (var i = 0; i < 5; i++) {
    result.add({
      "title": "第${i + 1}个$commonString",
      "description": "第${i + 1}个$commonString的一些备注文字"
    });
  }
  return result;
}

// 获取更多考试条目
List<Map>? more() {
  var r = Random().nextInt(100);

  const commonString = "更多的的考试";

  List<Map> result = [];

  for (var i = 0; i < 5; i++) {
    result.add({
      "title": "第${i + 1}个$commonString",
      "description": "第${i + 1}个$commonString的一些备注文字"
    });
  }
  return result;
}

// -----------------------------------------------------------

// 错题回顾

List<Map> getMistakes() {
  return [
    {
      "id": 1,
      "type": 1,
      "question": "这个是单选题的题干，题干的内容可能会很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长",
      "answers": [
        "这是第一个选项,文字长度一般",
        "这是第二个选项，文字长度很长很长,我们会对过长的文字进行换行处理,换行处理的效果大致如此,也就如此而已了",
        "这是第三个选项",
        "这是第四个选项",
        "这是第五个选项",
        "这是第六个选项",
      ],
      "answer": 1,
      "description": "这里是一些关于本题答案的具体解法与文字描述"
    },
    {
      "id": 2,
      "type": 2,
      "question": "这个是多选题的题干，题干的内容可能会很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长",
      "answers": [
        "这是第一个选项,文字长度一般",
        "这是第二个选项，文字长度很长很长,我们会对过长的文字进行换行处理,换行处理的效果大致如此,也就如此而已了",
        "这是第三个选项",
        "这是第四个选项",
        "这是第五个选项",
        "这是第六个选项",
      ],
      "answer": [0, 2, 3],
      "description": "这里是一些关于本题答案的具体解法与文字描述"
    },
    {
      "id": 3,
      "type": 3,
      "question":
          "这个是单题内多选的题干，题干的内容可能会很长很长,这里是第一个空__(1)__很长很长很长很长很这里是第二个空__(2)__长很长很长很长很长很长很长很长这里是第三个空__(3)__很长很长",
      "answers": [
        [
          "这是第一个选项,文字长度一般",
          "这是第二个选项，文字长度很长很长,我们会对过长的文字进行换行处理,换行处理的效果大致如此,也就如此而已了",
          "这是第三个选项",
          "这是第四个选项",
        ],
        [
          "这是第一个选项,文字长度一般",
          "这是第二个选项，文字长度很长很长,我们会对过长的文字进行换行处理,换行处理的效果大致如此,也就如此而已了",
          "这是第三个选项",
          "这是第四个选项",
        ],
        [
          "这是第一个选项,文字长度一般",
          "这是第二个选项，文字长度很长很长,我们会对过长的文字进行换行处理,换行处理的效果大致如此,也就如此而已了",
          "这是第三个选项",
          "这是第四个选项",
        ]
      ],
      "answer": [0, 2, 3],
      "description": "这里是一些关于本题答案的具体解法与文字描述"
    },
    {
      "id": 4,
      "type": 4,
      "blanks": 3,
      "question":
          "这个是填空题的题干，题干的内容可能会很长很长,这里是第一个空__(1)__很长很长很长很长很这里是第二个空__(2)__长很长很长很长很长很长很长很长这里是第三个空__(3)__很长很长",
      "answer": ["第一个空的答案", "第二个空的答案", "第三个空的答案"],
      "description": "这里是一些关于本题答案的具体解法与文字描述"
    },
    {
      "id": 5,
      "type": 5,
      "question":
          "这个是判断题的题干，题干的内容可能会很长很长,很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长",
      "answer": 1,
      "description": "这里是一些关于本题答案的具体解法与文字描述"
    },
    {
      "id": 6,
      "type": 6,
      "question":
          "这个是简答题的题干，题干的内容可能会很长很长,很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长很长",
      "answer": "这是简答题的答案文字",
      "description": "这里是一些关于本题答案的具体解法与文字描述"
    },
  ];
}
